In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
names = pd.Series({1:"Mohammed", 2:"Fahad", 3:"Saud"})
names

1    Mohammed
2       Fahad
3        Saud
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [6]:
names.index = [11,12,13]
names

11    Mohammed
12       Fahad
13        Saud
dtype: object

## Q3: Retrieve First and second elements.

In [11]:
names[0:2]

11    Mohammed
12       Fahad
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [20]:
x = pd.Series({14:"Mohammed"})
names = names.append(x)
print(names)
print("-----------------------------")
names = names.drop_duplicates()
print(names)

11    Mohammed
12       Fahad
13        Saud
14    Mohammed
14    Mohammed
14    Mohammed
14    Mohammed
dtype: object
-----------------------------
11    Mohammed
12       Fahad
13        Saud
dtype: object

C:\Users\mabal\AppData\Local\Temp\ipykernel_12612\1854034901.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  names = names.append(x)

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [35]:
 students = pd.DataFrame({"ID":[1,2,3],
                        "Name":["Mohammed","Fahad","Saud"],
                        "GPA":[4.5,3.78,2.80]})
students

   ID      Name   GPA
0   1  Mohammed  4.50
1   2     Fahad  3.78
2   3      Saud  2.80

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [38]:
student1 = pd.read_csv("educ_figdp_1_Data.csv")
student1.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [46]:
student1[0:5]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

In [47]:
student1.loc[0:5]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e